10/data/attachments/671229870810b78.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_268dd3fb-588f-47ee-957e-099828b7bbc5</nif:username>
            <nif:friendToBeAdded>Lisa_black_Actions_47504_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>